<?php
include_once "include/header.php";
?>

                <li class="nav-item"><a href="index.php" class="nav-link pl-0">Головна</a></li>
                <li class="nav-item"><a href="history.php" class="nav-link">Історія</a></li>
                <li class="nav-item"><a href="teacher.php" class="nav-link">Викладачі</a></li>
                <li class="nav-item"><a href="news.php" class="nav-link">Новини</a></li>
                <div class="dropdown collapse navbar-collapse navbar-nav mr-auto">
                    <li class="nav-item"><a href="#" class="nav-link">Навчальна діяльність <i class="ion-ios-arrow-down"></i></a></li>
                    <ul class="dropdown-menu" aria-labelledby="dropdownMenuButton1">
                        <li><a class="nav-item dropdown-item" href="nav-plan.php" class="nav-link">Навчальний план</a></li>
                        <li><a class="nav-item dropdown-item" href="kursovi.php" class="nav-link">Курсові роботи</a></li>
                        <li><a class="nav-item dropdown-item" href="educational.php" class="nav-link">Виховні</a></li>
                    </ul>
                </div>
                <li class="nav-item"><a href="#" class="nav-link">Випускники</a></li>
                <li class="nav-item"><a href="galery.php" class="nav-link">Галерея</a></li>
                <li class="nav-item"><a href="contact.php" class="nav-link">Контакти</a></li>
            </ul>
        </div>
    </div>
</nav>
<section class="hero-wrap hero-wrap-2" style="background-image: url('images/bg1.jpg');">
    <div class="overlay"></div>
    <div class="container">
        <div class="row no-gutters slider-text align-items-center justify-content-center">
            <div class="col-md-9 ftco-animate text-center">
                <h1 class="mb-2 bread">Виховні заходи</h1>
                <p class="breadcrumbs"><span class="mr-2"><a href="index.php">Головна <i class="ion-ios-arrow-forward"></i></a></span> <span>Виховні заходи<i class="ion-ios-arrow-forward"></i></span></p>
            </div>
        </div>
    </div>
</section>

<section class="ftco-section bg-light"">
    <div class="container" align="justify">
        <h2 class="mb-3">Дні циклової комісії діловодства</h2>
        <p>11 травня відбулися основні заходи з відзначення Днів циклової комісії «Діловодство». Почався
            захід з презентації студентських стінгазет «Стиль ділової людини», де
            усі бажаючі мали змогу ознайомитися з сучасними новинками одягу та  зачісок ділової особистості.</p>
        <p>Кандидат психологічних наук, практичний психолог коледжу та член циклової комісії діловодства Зеленська Тетяна
            Анатолівна провела психологічний тренінг на визначення ділових якостей студентів-діловодів.</p>
        <p>Справжні діловоди мають знати не тільки як оформляти документи, але й як майбутні
            секретарі правильно готувати та подавати чай. Кандидат історичних наук та член циклової
            комісії діловодства Мацко Наталя Степанівна провела лекцію «Історія чаю», на якій розповіла
            та продемонструвала за допомогою мультимедіа де
            вирощують чай, як його збирають, сортують, як правильно обрати якісний продукт та приготувати.</p>
        <p>Наступним етапом святкування була презентація бутербродів «Бутербродне царство».
            Студенти-діловоди  ІІ та ІІІ курсу підготували різні види бутербродів, розповіли як правильно
            їх готувати та подавати. Усі бажаючі та гості мали змогу покуштувати витвори кулінарії.</p>
        <p>Завершальним етапом став конкурс «Кращий за спеціальністю». Враховуючи тестові завдання з
            предметних дисциплін, підготовку кожного студента до проведення
            днів циклової комісії та активність у різних обговореннях кращою визнано групу Д-21.</p>

        <p>
            <img src="images/vuhovna1.JPG" class="img-history" alt="...">
        </p>


        <h2 class="mb-3">Зустріч з письменниками</h2>
        <p>12 травня 2017 р. студенти та викладачі Гусятинського коледжу ТНТУ стали учасниками зустрічі із відомими українськими
            письменниками та видавцями братами Віталієм та Дмитром Капрановими.</p>
        <p>Захід проходив в актовому залі Гусятинського районного центру дитячої та
            юнацької творчості. На зустріч також прийшли ті, хто цінують книгу.</p>
        <p>
            <img src="images/vuhovna2.JPG" class="img-history" alt="...">
        </p>
        <p>В рамках заходу Дмитро та Віталій Капранови презентували свою творчість. З собою брати привезли такі книги як: «Я лайкаю Україну»,
            «Щоденник моєї секретарки», «Мальована історія України», «Веселих свят», роман «Забудь — річка» та ін.</p>
        <p>Захід проходив у теплій, дружній атмосфері, присутні спілкувалися з
            письменниками, бажаючі мали змогу придбати книги авторів.</p>
        <p>
            <img src="images/vuhovna3.JPG" class="img-history" alt="...">
        </p>

        <h2 class="mb-3">Участь студентів Гусятинського коледжу у селищних заходах</h2>
        <p>11 травня 2017 р. студенти Гусятинського коледжу ТНТУ імені Івана Пулюя взяли участь в
            урочистій церемонії підняття Державного Прапора України та Прапора Європейського Союзу у
            селищі Гусятин, яка відбулася на виконання доручення Адміністрації Президента України, враховуючи
            стратегічний  курс  України на європейську інтеграцію та з нагоди Дня Європи в Україні.</p>

        <p>
            <img src="images/vuhovna4.JPG" class="img-history" alt="...">
        </p>
        <p>5 травня 2017 р. напередодні Дня пам’яті та примирення та Дня Перемоги над нацизмом у
            Другій світовій війні студенти та працівники Гусятинського коледжу ТНТУ
            імені Івана Пулюя взяли участь у мітингу-реквієм, приуроченому Дню пам’яті та примирення. </p>

        <p>Колона на чолі із жовто-блакитним знаменом та символічним вінком із червоних маків за участю представників влади, працівників державних установ, молоді та громадськості міста, студентів Гусятинського
            коледжу рушила до Меморіалу Слави. Там відбувся мітинг-реквієм, приурочений цій визначній даті.</p>





    </div>
</section>

<?php
include_once "include/footer.php";
?>
