<?php
include_once "include/header.php";
?>

                <li class="nav-item"><a href="index.php" class="nav-link pl-0">Головна</a></li>
                <li class="nav-item active"><a href="history.php" class="nav-link">Історія</a></li>
                <li class="nav-item"><a href="teacher.php" class="nav-link">Викладачі</a></li>
                <li class="nav-item"><a href="news.php" class="nav-link">Новини</a></li>
                <div class="dropdown collapse navbar-collapse navbar-nav mr-auto">
                    <li class="nav-item"><a href="#" class="nav-link">Навчальна діяльність <i class="ion-ios-arrow-down"></i></a></li>
                    <ul class="dropdown-menu" aria-labelledby="dropdownMenuButton1">
                        <li><a class="nav-item dropdown-item" href="nav-plan.php" class="nav-link">Навчальний план</a></li>
                        <li><a class="nav-item dropdown-item" href="kursovi.php" class="nav-link">Курсові роботи</a></li>
                        <li><a class="nav-item dropdown-item" href="educational.php" class="nav-link">Виховні</a></li>
                    </ul>
                </div>
                <li class="nav-item"><a href="#" class="nav-link">Випускники</a></li>
                <li class="nav-item"><a href="galery.php" class="nav-link">Галерея</a></li>
                <li class="nav-item"><a href="contact.php" class="nav-link">Контакти</a></li>
            </ul>
        </div>
    </div>
</nav>
<section class="hero-wrap hero-wrap-2" style="background-image: url('images/bg1.jpg');">
    <div class="overlay"></div>
    <div class="container">
        <div class="row no-gutters slider-text align-items-center justify-content-center">
            <div class="col-md-9 ftco-animate text-center">
                <h1 class="mb-2 bread">Історія</h1>
                <p class="breadcrumbs"><span class="mr-2"><a href="index.php">Головна <i class="ion-ios-arrow-forward"></i></a></span> <span>Історія <i class="ion-ios-arrow-forward"></i></span></p>
            </div>
        </div>
    </div>
</section>



<section class="ftco-section bg-light"">
    <div class="container" align="justify">
        <h2 class="mb-3">Циклова комісія діловодства</h2>
        <p>
            Циклова комісія діловодства організована у 2003 році у зв’язку із ліцензуванням спеціальності
        «Діловодство» (2002 р.). У 2005, 2010 та 2015 рр. успішно пройдено акредитаційну експертизу.
            За висновками комісій відзначено високий рівень підготовки випускників.
        </p>
        <p>
            На кожному підприємстві необхідний фахівець з навичками документування, володіння комп'ютерними
        технологіями, діловою українською та іноземними мовами, який уміє вести пошук, аналіз та
        реферування інформації, має навички ділового етикету, офісного сервісу, окрім того, є
        ініціативною, творчою особистістю. Таке соціальне замовлення і визначає вимоги до змісту
            навчально-виховного процесу, який здійснюють викладачі циклової комісії.
        </p>
        <p>
            Очолює циклову комісію викладач-методист Палагута Марія Іванівна.
        </p>
        <p>
            <img src="images/image1.PNG" class="img-history" alt="...">
        </p>
        <p>Професійну і практичну підготовку студентів здійснюють: Зеленська Тетяна Анатоліївна,
            кандидат психологічних наук, Мацко Наталія Степанівна, кандидат історичних наук,
            Мисько Олена Павлівна — викладач вищої категорії, Древняк Людмила Ярославівна, Новінчук Степан
            Михайлович — викладачі І категорії.</p>
        <p>Палагута М. І. працює у коледжі з 1996 року. Володіє різноманітними методами навчання, має високу
            теоретичну підготовку, на професійному науково-методичному рівні викладає спецдисципліни.
            Викладач постійно у творчому пошуку, впроваджує у практику новітні робочі технології, використовує
            різноманітні форми та методи навчання, удосконалює у студентів мовленнєву діяльність,
            моральну культуру, взаємоповагу, прищеплює їм любов до обраної професії.</p>
        <p>Палагута М.І. розробляє навчальні плани, робочі програми, створила повне науково-методичне
            забезпечення навчальних дисциплін спеціальності «Інформаційна бібліотечна та архівна справа».
            Постійно дбає про поповнення і забезпечення спеціальності науково-методичною літературою.</p>

        <p>Викладач постійно вдосконалює свій професійний рівень, не одноразово брала участь
            у роботі акредитаційної комісії від МОН.</p>
        <p>
            <img src="images/image2.PNG" class="img-history" alt="...">
        </p>
        <p>
            <img src="images/image3.PNG" class="img-history" alt="...">
        </p>
        <p>
            <img src="images/image4.PNG" class="img-history" alt="...">
        </p>
        <p>Зеленська Тетяна Анатоліївна працює у коледжі з 1998 року, викладає дисципліни
            психологічного напряму. Використовуючи різноманітні тестові методики,  спонукає
            студентів міркувати, порівнювати, самостійно робити висновки й узагальнення,
            практикує проведення занять-тренінгів, занять-диспутів, занять-психологічних
            досліджень, постійно працює над своїм удосконаленням, веде гурток  «Пізнай себе».
            Є авторкою понад 20 наукових статей у фахових виданнях.</p>
        <p>
            <img src="images/image5.PNG" class="img-history" alt="...">
        </p>
        <p>
            <img src="images/image6.PNG" class="img-history" alt="...">
        </p>
        <p>Мисько Олена Павлівна у коледжі працює з 2004 року, практикується у створенні
            мультимедійних презентацій із дисципліни «Культурологія», спонукає студентів
            бережливо ставитись до пам’яток архітектури. Успішно проводить відкриті заняття.</p>
        <p>Древняк Людмила Ярославівна працює у коледжі з 2008 р., з 2010 читає дисципліни
            «Документознавство», «Навчальна практика». Молодий ініціативний викладач-аспірант І
            категорії постійно підвищує свій фаховий рівень. Підготувала у співавторстві з Палагутою М.І.
            посібник «Методичний комплекс до вивчення дисципліни «Навчальна практика» для студентів
            спеціальності «Інформаційна, бібліотечна та архівна справа»», який отримав рецензії ТНЕУ
            та Миколаївського коледжу культури та мистецтва та затверджений на засіданні Вченої ради
            ТНТУ імені Івана Пулюя. Навчається у магістратурі Західноукраїнського національного
            університету за спеціальністю «Документознавство та інформаційна діяльність».</p>
        <p>Удосконалює духовний розвиток особистості на заняттях із «Релігієзнавства» Мацко Наталя Степанівна
            кандидат історичних наук, викладач вищої категорії. У Гусятинському коледжі із 2009 р. на
            посаді викладача суспільних дисциплін. Мацко Н.С. активно займається науковою діяльністю,
            є авторкою 30 наукових статей у фахових виданнях. Із 2017 р. є науковим керівником секції:
            «Етнологія» Гусятинської філії Тернопільського обласного територіального відділення МАН України
            на базі ГК ТНТУ, учасники якої є переможцями та дипломантами ІІ-ІІІ етапів конкурсів-захистів
            наукових робіт учнів-членів МАН України.</p>
        <p>
            <img src="images/image8.PNG" class="img-history" alt="...">
        </p>
        <p>Новінчук Степан Михайлович працює у Гусятинському коледжі на посаді викладача
            суспільних дисциплін з 2011 року. За час роботи Новінчук С. М. зарекомендував
            себе як відповідальний педагог та умілий організатор.  Проводить заняття з урахуванням
            вікових та психологічних особливостей студентів, відповідно до сучасних вимог організації
            освітнього процесу. Під час їх проведення вміло застосовує інформаційні технології, що дає змогу
            значно підвищувати ефективність навчання.</p>
        <p>З 2003 року викладачами циклової комісії опубліковано понад 50
            наукових статей, підготовлено понад 70 методичних розробок і посібників,
            під їх керівництвом активно ведеться студентська наукова робота.Для підвищення
            рівня фахової підготовки у коледж запрошуються викладачі ТНЕУ: к.і.н., доцент Гомотюк
            О.Є, к.іст.н. Дацко І.Б., завідувач Гусятинським районним архівом Шмигельська Л.С., завідувач
            загальним відділом Гусятинської РДА Ковалишин О.І.,
            головний спеціаліст районного центру зайнятості Гачинська О.С.</p>
        <p>Студенти проходять практику в архівах, на підприємствах та установах у відділах кадрів,
            канцеляріях,  знайомляться із документацією і створюють власні проекти, що презентують
            їхні фахові навички. Завершують навчання складанням комплексного державного іспиту.
            Голови ДЕК Сичевська О.В., та Ковалишин О.І. відзначають високий рівень практичних знань студентів.</p>
        <p>
            <img src="images/image7.PNG" class="img-history" alt="...">
        </p>
        <p>Традиційно проводяться дні спеціальності. Студенти-діловоди вміло модифікують
            виробничі ситуації на конкурсах, беруть участь у різноманітних тематичних вечорах, виставках.
            Кращі роботи студентів знаходять своє відображення в альбомах.</p>
        <p>З початку створення спеціальності диплом за фахом отримали 64 випускники, 19 закінчили коледж
            з відзнакою. Із усіх підготовлених спеціалістів 40% працюють за фахом, ще 40% продовжують
            навчання у Тернопільському національному економічному університеті, та Івано-Франківському
            національному технічному університеті нафти і газу.
            Усі випускники отримали робітничу спеціальність «Оператор комп’ютерного набору».</p>
        <p>Гусятинський коледж ТНТУ імені Івана Пулюя один із перших у регіоні розпочав підготовку
            фахівців за спеціальністю «Діловодство». Сьогодні ми гордимося нашими випускниками Мороз Анжелікою,
            Осідак Вірою, Туряницею Любою, Кожухар Оксаною, Дундяк Інною, Чеботарьовою Христиною та ін.</p>
    </div>
</section>



<?php
include_once "include/footer.php";
?>
