-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Час створення: Лип 05 2023 р., 13:20
-- Версія сервера: 10.4.25-MariaDB
-- Версія PHP: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `tsk_dilovod`
--

-- --------------------------------------------------------

--
-- Структура таблиці `documents`
--

CREATE TABLE `documents` (
  `id_documents` int(11) NOT NULL,
  `name` text NOT NULL,
  `file` text NOT NULL,
  `avtor` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Структура таблиці `educational`
--

CREATE TABLE `educational` (
  `id` int(11) NOT NULL,
  `content` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп даних таблиці `educational`
--

INSERT INTO `educational` (`id`, `content`) VALUES
(1, '<h2 class=\"mb-3\">Дні циклової комісії діловодства </h2>\r\n        <p>\r\n            11 травня відбулися основні заходи з відзначення Днів циклової комісії «Діловодство». Почався\r\n            захід з презентації студентських стінгазет «Стиль ділової людини», де\r\n            усі бажаючі мали змогу ознайомитися з сучасними новинками одягу та  зачісок ділової особистості.\r\n        </p>\r\n        <p>\r\n            Кандидат психологічних наук, практичний психолог коледжу та член циклової комісії діловодства Зеленська Тетяна\r\n            Анатолівна провела психологічний тренінг на визначення ділових якостей студентів-діловодів.\r\n        </p>\r\n        <div class=\"row\">\r\n\r\n            <div class=\"col-lg-6\">\r\n                <img src=\"images/vuhovna1.JPG\" class=\"img-thumbnail\" alt=\"...\">\r\n            </div>\r\n\r\n            <div class=\"col-lg-6\">\r\n                <div class=\"record-text\">\r\n                    <p>\r\n                        Справжні діловоди мають знати не тільки як оформляти документи, але й як майбутні\r\n                        секретарі правильно готувати та подавати чай. Кандидат історичних наук та член циклової\r\n                        комісії діловодства Мацко Наталя Степанівна провела лекцію «Історія чаю», на якій розповіла\r\n                        та продемонструвала за допомогою мультимедіа де\r\n                        вирощують чай, як його збирають, сортують, як правильно обрати якісний продукт та приготувати.\r\n                    </p>\r\n                    <p>\r\n                        Наступним етапом святкування була презентація бутербродів «Бутербродне царство».\r\n                        Студенти-діловоди  ІІ та ІІІ курсу підготували різні види бутербродів, розповіли як правильно\r\n                        їх готувати та подавати. Усі бажаючі та гості мали змогу покуштувати витвори кулінарії.\r\n                    </p>\r\n\r\n                </div>\r\n            </div>\r\n\r\n            <p>\r\n                Завершальним етапом став конкурс «Кращий за спеціальністю». Враховуючи тестові завдання з\r\n                предметних дисциплін, підготовку кожного студента до проведення\r\n                днів циклової комісії та активність у різних обговореннях кращою визнано групу Д-21.\r\n            </p>\r\n\r\n            <h2 class=\"mb-3 mt-3\">Зустріч з письменниками</h2>\r\n            <p>\r\n                12 травня 2017 р. студенти та викладачі Гусятинського коледжу ТНТУ стали учасниками зустрічі із відомими українськими\r\n                письменниками та видавцями братами Віталієм та Дмитром Капрановими.\r\n            </p>\r\n            <p>\r\n                Захід проходив в актовому залі Гусятинського районного центру дитячої та\r\n                юнацької творчості. На зустріч також прийшли ті, хто цінують книгу.\r\n            </p>\r\n            <p>\r\n                В рамках заходу Дмитро та Віталій Капранови презентували свою творчість. З собою брати привезли такі книги як: «Я лайкаю Україну»,\r\n                «Щоденник моєї секретарки», «Мальована історія України», «Веселих свят», роман «Забудь — річка» та ін.\r\n            </p>\r\n            <p>\r\n                Захід проходив у теплій, дружній атмосфері, присутні спілкувалися з\r\n                письменниками, бажаючі мали змогу придбати книги авторів.\r\n            </p>\r\n\r\n\r\n            <div class=\"row\">\r\n\r\n                <div class=\"col-lg-6\">\r\n                    <img src=\"images/vuhovna2.JPG\" class=\"img-thumbnail\">\r\n                </div>\r\n\r\n                <div class=\"col-lg-6\">\r\n                    <img src=\"images/vuhovna3.JPG\" class=\"img-thumbnail\" >\r\n                </div>\r\n\r\n            </div>\r\n\r\n            <h2 class=\"mb-3 mt-3\">Участь студентів Гусятинського коледжу у селищних заходах</h2>\r\n\r\n            <div class=\"row\">\r\n                <div class=\"col-lg-6\">\r\n                    <div class=\"record-text\">\r\n\r\n                        <p>\r\n                            11 травня 2017 р. студенти Гусятинського коледжу ТНТУ імені Івана Пулюя взяли участь в\r\n                            урочистій церемонії підняття Державного Прапора України та Прапора Європейського Союзу у\r\n                            селищі Гусятин, яка відбулася на виконання доручення Адміністрації Президента України, враховуючи\r\n                            стратегічний  курс  України на європейську інтеграцію та з нагоди Дня Європи в Україні.\r\n                        </p>\r\n\r\n                        <p>\r\n                            5 травня 2017 р. напередодні Дня пам’яті та примирення та Дня Перемоги над нацизмом у\r\n                            Другій світовій війні студенти та працівники Гусятинського коледжу ТНТУ\r\n                            імені Івана Пулюя взяли участь у мітингу-реквієм, приуроченому Дню пам’яті та примирення.\r\n                        </p>\r\n\r\n                        <p>\r\n                            Колона на чолі із жовто-блакитним знаменом та символічним вінком із червоних маків за участю представників влади, працівників державних установ, молоді та громадськості міста, студентів Гусятинського\r\n                            коледжу рушила до Меморіалу Слави. Там відбувся мітинг-реквієм, приурочений цій визначній даті.\r\n                        </p>\r\n\r\n                    </div>\r\n                </div>\r\n\r\n                <div class=\"col-lg-6\">\r\n                    <img class=\"img-thumbnail\"  src=\"images/vuhovna4.JPG\">\r\n                </div>\r\n\r\n            </div>');

-- --------------------------------------------------------

--
-- Структура таблиці `galery`
--

CREATE TABLE `galery` (
  `id_galery` int(11) NOT NULL,
  `img_galery` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `galery`
--

INSERT INTO `galery` (`id_galery`, `img_galery`) VALUES
(1, 'images/image1.PNG'),
(2, 'images/image2.PNG'),
(3, 'images/image8.PNG'),
(4, 'images/image4.PNG'),
(5, 'images/image6.PNG'),
(6, 'images/image3.PNG'),
(7, 'images/image5.PNG'),
(8, 'images/image7.PNG'),
(11, 'images/image9.jpg'),
(13, 'images/v2022.JPG'),
(14, 'images/v2021.JPG');

-- --------------------------------------------------------

--
-- Структура таблиці `grupa`
--

CREATE TABLE `grupa` (
  `id_grupa` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `curator` int(11) NOT NULL,
  `img` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп даних таблиці `grupa`
--

INSERT INTO `grupa` (`id_grupa`, `year`, `name`, `curator`, `img`) VALUES
(1, 2023, 'Д-31', 22, 'images/v2023.JPG'),
(2, 2022, 'Д-31', 3, 'images/v2022.JPG'),
(7, 2021, 'Д-31', 4, 'images/v2020.JPG'),
(9, 2020, 'Д-31', 1, 'images/v2021.JPG'),
(10, 2019, 'Д-31', 4, 'images/v2019.JPG');

-- --------------------------------------------------------

--
-- Структура таблиці `history`
--

CREATE TABLE `history` (
  `id` int(11) NOT NULL,
  `content` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп даних таблиці `history`
--

INSERT INTO `history` (`id`, `content`) VALUES
(1, '<h2 class=\"mb-3\">Циклова комісія діловодства </h2>\r\n        <p>\r\n            Циклова комісія діловодства організована у 2003 році у зв’язку із ліцензуванням спеціальності\r\n        «Діловодство» (2002 р.). У 2005, 2010 та 2015 рр. успішно пройдено акредитаційну експертизу.\r\n            За висновками комісій відзначено високий рівень підготовки випускників.\r\n        </p>\r\n\r\n        <p>\r\n            На кожному підприємстві необхідний фахівець з навичками документування, володіння комп\'ютерними\r\n        технологіями, діловою українською та іноземними мовами, який уміє вести пошук, аналіз та\r\n        реферування інформації, має навички ділового етикету, офісного сервісу, окрім того, є\r\n        ініціативною, творчою особистістю. Таке соціальне замовлення і визначає вимоги до змісту\r\n            навчально-виховного процесу, який здійснюють викладачі циклової комісії.\r\n        </p>\r\n\r\n        <p>\r\n            <b>Очолює циклову комісію викладач-методист Палагута Марія Іванівна.</b>\r\n        </p>\r\n\r\n        <div class=\"row\">\r\n\r\n            <div class=\"col-lg-6\">\r\n                    <img class=\"img-thumbnail\"  src=\"images/image1.PNG\">\r\n            </div>\r\n\r\n            <div class=\"col-lg-6\">\r\n                <div class=\"record-text\">\r\n\r\n                    <p>\r\n                        Палагута М. І. працює у коледжі з 1996 року. Володіє різноманітними методами навчання, має високу\r\n                        теоретичну підготовку, на професійному науково-методичному рівні викладає спецдисципліни.\r\n                        Викладач постійно у творчому пошуку, впроваджує у практику новітні робочі технології, використовує\r\n                        різноманітні форми та методи навчання, удосконалює у студентів мовленнєву діяльність,\r\n                        моральну культуру, взаємоповагу, прищеплює їм любов до обраної професії.\r\n                    </p>\r\n\r\n                    <p>\r\n                        Палагута М.І. розробляє навчальні плани, робочі програми, створила повне науково-методичне\r\n                        забезпечення навчальних дисциплін спеціальності «Інформаційна бібліотечна та архівна справа».\r\n                        Постійно дбає про поповнення і забезпечення спеціальності науково-методичною літературою.\r\n                    </p>\r\n\r\n                </div>\r\n            </div>\r\n\r\n        </div>\r\n\r\n        <p>\r\n            Викладач постійно вдосконалює свій професійний рівень, не одноразово брала участь\r\n            у роботі акредитаційної комісії від МОН.\r\n        </p>\r\n\r\n        <p>\r\n            Професійну і практичну підготовку студентів здійснюють: Зеленська Тетяна Анатоліївна,\r\n            кандидат психологічних наук, Мацко Наталія Степанівна, кандидат історичних наук,\r\n            Мисько Олена Павлівна — викладач вищої категорії, Древняк Людмила Ярославівна, Новінчук Степан\r\n            Михайлович — викладачі І категорії.\r\n        </p>\r\n\r\n        <div class=\"row\">\r\n\r\n            <div class=\"col-lg-6\">\r\n                <img class=\"img-thumbnail\"  src=\"images/image2.PNG\">\r\n            </div>\r\n\r\n            <div class=\"col-lg-6\">\r\n                <img class=\"img-thumbnail\"  src=\"images/image4.PNG\">\r\n            </div>\r\n\r\n        </div>\r\n        <br>\r\n\r\n        <p>\r\n            <b>Зеленська Тетяна Анатоліївна</b> працює у коледжі з 1998 року, викладає дисципліни\r\n            психологічного напряму. Використовуючи різноманітні тестові методики,  спонукає\r\n            студентів міркувати, порівнювати, самостійно робити висновки й узагальнення,\r\n            практикує проведення занять-тренінгів, занять-диспутів, занять-психологічних\r\n            досліджень, постійно працює над своїм удосконаленням, веде гурток  «Пізнай себе».\r\n            Є авторкою понад 20 наукових статей у фахових виданнях.\r\n        </p>\r\n\r\n        <div class=\"row\">\r\n\r\n            <div class=\"col-lg-6\">\r\n                <img class=\"img-thumbnail\"  src=\"images/image5.PNG\">\r\n            </div>\r\n\r\n            <div class=\"col-lg-6\">\r\n                <img class=\"img-thumbnail\"  src=\"images/image6.PNG\">\r\n            </div>\r\n\r\n        </div>\r\n        <br>\r\n\r\n        <p>\r\n            <b>Мисько Олена Павлівна</b> у коледжі працює з 2004 року, практикується у створенні\r\n            мультимедійних презентацій із дисципліни «Культурологія», спонукає студентів\r\n            бережливо ставитись до пам’яток архітектури. Успішно проводить відкриті заняття.\r\n        </p>\r\n\r\n        <p>\r\n            <b>Древняк Людмила Ярославівна</b> працює у коледжі з 2008 р., з 2010 читає дисципліни\r\n            «Документознавство», «Навчальна практика». Молодий ініціативний викладач-аспірант І\r\n            категорії постійно підвищує свій фаховий рівень. Підготувала у співавторстві з Палагутою М.І.\r\n            посібник «Методичний комплекс до вивчення дисципліни «Навчальна практика» для студентів\r\n            спеціальності «Інформаційна, бібліотечна та архівна справа»», який отримав рецензії ТНЕУ\r\n            та Миколаївського коледжу культури та мистецтва та затверджений на засіданні Вченої ради\r\n            ТНТУ імені Івана Пулюя. Навчається у магістратурі Західноукраїнського національного\r\n            університету за спеціальністю «Документознавство та інформаційна діяльність».\r\n        </p>\r\n\r\n        <div class=\"row\">\r\n\r\n            <div class=\"col-lg-6\">\r\n                <img class=\"img-thumbnail\"  src=\"images/image8.PNG\">\r\n            </div>\r\n\r\n            <div class=\"col-lg-6\">\r\n                <div class=\"record-text\">\r\n\r\n                    <p>\r\n                        Удосконалює духовний розвиток особистості на заняттях із «Релігієзнавства» <b>Мацко Наталя Степанівна</b>\r\n                        кандидат історичних наук, викладач вищої категорії. У Гусятинському коледжі із 2009 р. на\r\n                        посаді викладача суспільних дисциплін. Мацко Н.С. активно займається науковою діяльністю,\r\n                        є авторкою 30 наукових статей у фахових виданнях. Із 2017 р. є науковим керівником секції:\r\n                        «Етнологія» Гусятинської філії Тернопільського обласного територіального відділення МАН України\r\n                        на базі ГК ТНТУ, учасники якої є переможцями та дипломантами ІІ-ІІІ етапів конкурсів-захистів\r\n                        наукових робіт учнів-членів МАН України.\r\n                    </p>\r\n\r\n                </div>\r\n            </div>\r\n\r\n        </div>\r\n        <br>\r\n\r\n        <div class=\"row\">\r\n            <div class=\"col-lg-6\">\r\n                <div class=\"record-text\">\r\n\r\n                    <p>\r\n                        З 2003 року викладачами циклової комісії опубліковано понад 50\r\n                        наукових статей, підготовлено понад 70 методичних розробок і посібників,\r\n                        під їх керівництвом активно ведеться студентська наукова робота.Для підвищення\r\n                        рівня фахової підготовки у коледж запрошуються викладачі ТНЕУ: к.і.н., доцент Гомотюк\r\n                        О.Є, к.іст.н. Дацко І.Б., завідувач Гусятинським районним архівом Шмигельська Л.С., завідувач\r\n                        загальним відділом Гусятинської РДА Ковалишин О.І.,\r\n                        головний спеціаліст районного центру зайнятості Гачинська О.С.\r\n                    </p>\r\n\r\n                    <p>\r\n                        Студенти проходять практику в архівах, на підприємствах та установах у відділах кадрів,\r\n                        канцеляріях,  знайомляться із документацією і створюють власні проекти, що презентують\r\n                        їхні фахові навички. Завершують навчання складанням комплексного державного іспиту.\r\n                        Голови ДЕК Сичевська О.В., та Ковалишин О.І. відзначають високий рівень практичних знань студентів.\r\n                    </p>\r\n\r\n                </div>\r\n            </div>\r\n\r\n            <div class=\"col-lg-6\">\r\n                <img class=\"img-thumbnail\"  src=\"images/image7.PNG\">\r\n            </div>\r\n\r\n        </div>\r\n        <br>\r\n\r\n        <p>\r\n            Традиційно проводяться дні спеціальності. Студенти-діловоди вміло модифікують\r\n            виробничі ситуації на конкурсах, беруть участь у різноманітних тематичних вечорах, виставках.\r\n            Кращі роботи студентів знаходять своє відображення в альбомах.\r\n        </p>\r\n\r\n        <p>\r\n            З початку створення спеціальності диплом за фахом отримали 64 випускники, 19 закінчили коледж\r\n            з відзнакою. Із усіх підготовлених спеціалістів 40% працюють за фахом, ще 40% продовжують\r\n            навчання у Тернопільському національному економічному університеті, та Івано-Франківському\r\n            національному технічному університеті нафти і газу.\r\n            Усі випускники отримали робітничу спеціальність «Оператор комп’ютерного набору».\r\n        </p>\r\n\r\n        <p>\r\n            Гусятинський коледж ТНТУ імені Івана Пулюя один із перших у регіоні розпочав підготовку\r\n            фахівців за спеціальністю «Діловодство». Сьогодні ми гордимося нашими випускниками Мороз Анжелікою,\r\n            Осідак Вірою, Кожухар Оксаною, Дундяк Інною, Чеботарьовою Христиною та ін.\r\n        </p>');

-- --------------------------------------------------------

--
-- Структура таблиці `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `title` varchar(100) NOT NULL,
  `img` text NOT NULL,
  `content` text NOT NULL,
  `date` date NOT NULL,
  `avtor` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `news`
--

INSERT INTO `news` (`id`, `title`, `img`, `content`, `date`, `avtor`) VALUES
(2, 'Діловодство', 'http://www.guscollege.com/images/stories/about/029/dilovodstvo.jpg', 'З початку створення спеціальності диплом за фахом отримали 64 випускники, 19 закінчили коледж з відзнакою. Із усіх підготовлених спеціалістів 40% працюють за фахом, ще 40% продовжують навчання у Тернопільському національному економічному університеті, та Івано-Франківському національному технічному університеті нафти і газу. Усі випускники отримали робітничу спеціальність «Оператор комп’ютерного набору».\r\n\r\nГусятинський коледж ТНТУ імені Івана Пулюя один із перших у регіоні розпочав підготовку фахівців за спеціальністю «Діловодство». Сьогодні ми гордимося нашими випускниками Мороз Анжелікою, Осідак Вірою, Туряницею Любою, Кожухар Оксаною, Дундяк Інною, Чеботарьовою Христиною та ін.', '2022-08-09', 4),
(12, 'Наукові статті', 'images/image7.PNG', 'З 2003 року викладачами циклової комісії опубліковано понад 50 наукових статей, підготовлено понад 70 методичних розробок і посібників, під їх керівництвом активно ведеться студентська наукова робота.Для підвищення рівня фахової підготовки у коледж запрошуються викладачі ТНЕУ: к.і.н., доцент Гомотюк О.Є, к.іст.н. Дацко І.Б., завідувач Гусятинським районним архівом Шмигельська Л.С., завідувач загальним відділом Гусятинської РДА Ковалишин О.І., головний спеціаліст районного центру зайнятості Гачинська О.С.', '2022-03-17', 1),
(18, 'Творчі, креативні та ініціативні…', 'images/image9.jpg', 'Під таким девізом 27 квітня 2023 року у ВСП «Гусятинський фаховий\r\nколедж ТНТУ» проходив день циклової комісії спеціальності 029\r\n«Інформаційна, бібліотечна та архівна справа».\r\nРозпочався він з виставки ділових костюмів, де студенти могли\r\nознайомитися з основними видами ділового дрес-коду, показати свої здібності в\r\nпідборі, моделюванні стилю одягу та аксесуарів. Для кращого закріплення цих\r\nзнань вони переглянули презентацію і прослухали доповідь Древняк Л.Я.\r\n«Дрес-код: правила офіційних заходів».\r\nПрактичний психолог Мисько Олена Павлівна провела зі студентами\r\nпсихогеометричний тест (Сьюзен Дилінгер) на дослідження особистості. Усі\r\nбажаючі вибирали одну із запропонованих геометричних фігур, після чого\r\nОлена Павлівна описала їх характеристики.\r\nМарією Іванівною було організовано зустріч із начальником загального\r\nвідділу апарату Гусятинської селищної ради Семеняк Ольгою Йосипівною.\r\nВона ознайомила студентів із типовою інструкцією з діловодства селищної\r\nради, розповіла про принципи оформлення вхідної та вихідної кореспонденції,\r\nправила та терміни зберігання різних видів документів, показала бланки\r\nнаказів, розпоряджень, протоколів.\r\nКожен діловод повинен вміти не тільки вести документообіг на\r\nпідприємстві, а й при необхідності організувати фуршетний стіл. На великій\r\nперерві студенти другого та третього курсу змагалися у вмінні швидко, творчо,\r\nкреативно приготувати та оформити бутерброди. Після чого журі оцінювали\r\nзовнішній вигляд накладанців та їх смакові якості. У конкурсі перемогла\r\nдружба!!!\r\nНаталія Степанівна розповіла присутнім про вплив соціальних мереж на\r\nжиття сучасної людини, студенти говорили про позитивні та негативні сторони\r\nІнтернету, про його вплив на студентську молодь та наше життя загалом.\r\nЗавершився наш день конкурсом «Кращий за спеціальностю». Діловоди\r\nІІ та ІІІ курсу мали можливість на практиці застосувати свої знання, пройти\r\n\r\nспівбесіду та оформити розпорядчі документи. Найкраще із цими завданнями\r\nвпоралася студентка-другокурсниця Пилипів Вікторія.\r\nСьогодні, за такий короткий, проте насичений день, студенти-діловоди\r\nмали змогу випробувати свої сили у різноманітних конкурсах, визначити свій\r\nтип особистості, дізнатися новинки документування та переглянути цікаві\r\nвідеоролики.', '2023-04-28', 3);

-- --------------------------------------------------------

--
-- Структура таблиці `students`
--

CREATE TABLE `students` (
  `id_students` int(11) NOT NULL,
  `FirstName` varchar(50) NOT NULL,
  `LastName` varchar(50) NOT NULL,
  `PoBatkovi` varchar(50) NOT NULL,
  `grupa` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп даних таблиці `students`
--

INSERT INTO `students` (`id_students`, `FirstName`, `LastName`, `PoBatkovi`, `grupa`) VALUES
(1, 'Випускник ', 'Тестовий', 'Іванович', 1);

-- --------------------------------------------------------

--
-- Структура таблиці `teachers`
--

CREATE TABLE `teachers` (
  `id_teacher` int(11) NOT NULL,
  `LastName` varchar(20) NOT NULL,
  `FirstName` varchar(20) NOT NULL,
  `PoBatkovi` varchar(20) NOT NULL,
  `position` text NOT NULL,
  `img_teacher` text NOT NULL,
  `content_teacher` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `teachers`
--

INSERT INTO `teachers` (`id_teacher`, `LastName`, `FirstName`, `PoBatkovi`, `position`, `img_teacher`, `content_teacher`) VALUES
(1, 'Палагута', 'Марія ', 'Іванівна', 'Голова циклової комісії документознавства, викладач-методист, спеціаліст вищої категорії.', 'images/foto1.JPG', 'Професійну і практичну підготовку студентів здійснюють: Зеленська Тетяна Анатоліївна, кандидат психологічних наук, Мацко Наталія Степанівна, кандидат історичних наук, Мисько Олена Павлівна — викладач вищої категорії, Древняк Людмила Ярославівна, Новінчук Степан Михайлович — викладачі І категорії.\r\n\r\nПалагута М. І. працює у коледжі з 1996 року. Володіє різноманітними методами навчання, має високу теоретичну підготовку, на професійному науково-методичному рівні викладає спецдисципліни. Викладач постійно у творчому пошуку, впроваджує у практику новітні робочі технології, використовує різноманітні форми та методи навчання, удосконалює у студентів мовленнєву діяльність, моральну культуру, взаємоповагу, прищеплює їм любов до обраної професії.\r\n\r\nПалагута М.І. розробляє навчальні плани, робочі програми, створила повне науково-методичне забезпечення навчальних дисциплін спеціальності «Інформаційна бібліотечна та архівна справа». Постійно дбає про поповнення і забезпечення спеціальності науково-методичною літературою.\r\n\r\nВикладач постійно вдосконалює свій професійний рівень, не одноразово брала участь у роботі акредитаційної комісії від МОН.'),
(2, 'Зеленська', 'Тетяна', 'Анатоліївна', 'к.п.н., викладач-методист, спеціаліст вищої категорії', 'images/foto6.JPG', 'Зеленська Тетяна Анатоліївна працює у коледжі з 1998 року, викладає дисципліни психологічного напряму. Використовуючи різноманітні тестові методики,  спонукає студентів міркувати, порівнювати, самостійно робити висновки й узагальнення, практикує проведення занять-тренінгів, занять-диспутів, занять-психологічних досліджень, постійно працює над своїм удосконаленням, веде гурток  «Пізнай себе». Є авторкою понад 20 наукових статей у фахових виданнях.'),
(3, 'Древняк', 'Людмила', 'Ярославівна', 'Спеціаліст вищої категорії', 'images/foto3.JPG', '<b>Древняк Людмила Ярославівна</b>, вища категорія. У коледжі працює з 2008 року, на посаді викладач ЦК з 2011 року.  Методички: конспект лекцій з дисципліни \" Документознавство\" для студентів спец. \" Діловодство\" (2011р),  Навчально- методичні рекомендації щодо виконання практичних робіт з дисципліни\" Навчальна практика \" (2015р), Методичний комплекс до вивчення дисципліни\"Навчальна практика \"( 2018р), Тестові завдання для самоконтролю (для студентів  спеціальності 029 «Інформаційна, бібліотечна та архівна справа») – 2020р. . Викладаю дисципліни: Навчальна практика, Документознавство, Офісний сервіс, Основи бібліотечно- бібліографічних знань, Професійна етика, Укр.мова за профспрямуванням, Етика ділового спілкування.<br>\r\n<b>Стажування:</b><br>\r\n1.Тернопільський національний педагогічний університет імені Володимира Гнатюка, соціально-гуманітарний блок (медійна компетентність). Свідоцтво ПК 000245 від 08.04.2020. 1 кредит  (30 год). <br>\r\n2.Тернопільський національний педагогічний університет імені Володимира Гнатюка, «Використання LMS Moodle в умовах дистанційного навчання» (цифрова компетентність). Свідоцтво ПК 000613 від 02.02.2021. 1 кредит  (30 год).<br>\r\n3.Тернопільський національний педагогічний університет імені Володимира Гнатюка, «Організаційно-правові аспекти інклюзивної освіти». Свідоцтво ПК 4777 від 14.02.2022. 1 кредит  (30 год).<br>\r\n4. Протидія та попередження булінгу (цькуванню) в закладах освіти – 2023р. ( Prometheus).'),
(4, 'Мацко', 'Наталя', 'Степанівна', 'Спеціаліст вищої категорії', 'http://guscollege.com/images/stories/about/union/matsko.jpg', 'Удосконалює духовний розвиток особистості на заняттях із «Релігієзнавства» Мацко Наталя Степанівна кандидат історичних наук, викладач вищої категорії. У Гусятинському коледжі із 2009 р. на посаді викладача суспільних дисциплін. Мацко Н.С. активно займається науковою діяльністю, є авторкою 30 наукових статей у фахових виданнях. Із 2017 р. є науковим керівником секції: «Етнологія» Гусятинської філії Тернопільського обласного територіального відділення МАН України на базі ГК ТНТУ, учасники якої є переможцями та дипломантами ІІ-ІІІ етапів конкурсів-захистів наукових робіт учнів-членів МАН України.'),
(6, 'Мисько', 'Олена', 'Павлівна', 'Викладач-методист, спеціаліст вищої категорії', 'images/foto2.JPG', 'Мисько Олена Павлівна у коледжі працює з 2004 року, практикується у створенні мультимедійних презентацій із дисципліни «Культурологія», спонукає студентів бережливо ставитись до пам’яток архітектури. Успішно проводить відкриті заняття.'),
(22, 'Гадюк', 'Руслана', 'Володимирівна', 'к.е.н., спеціаліст вищої категорії, викладач української мови та літератури.', 'images/Гадюк.jpg', '<b>Гадюк Руслана Володимирівна</b> викладає українську мову в навчальному закладі з 2017 року. Педагогічну діяльність активно поєднує з науковою: вона аспірант кафедри української мови Кам’янець-Подільського університету імені Івана Огієнка.  Працює над темою дисертації «Вербалізація  модальної семантики прохання в українській мові». Руслана Володимирівна з 2019 року є керівником секції «Українська мова та література», де працює зі студентами коледжу над програмними завданнями МАН України.');

-- --------------------------------------------------------

--
-- Структура таблиці `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп даних таблиці `users`
--

INSERT INTO `users` (`id`, `login`, `password`) VALUES
(1, 'admin', '12345');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `documents`
--
ALTER TABLE `documents`
  ADD PRIMARY KEY (`id_documents`),
  ADD KEY `avtor` (`avtor`);

--
-- Індекси таблиці `educational`
--
ALTER TABLE `educational`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `galery`
--
ALTER TABLE `galery`
  ADD PRIMARY KEY (`id_galery`);

--
-- Індекси таблиці `grupa`
--
ALTER TABLE `grupa`
  ADD PRIMARY KEY (`id_grupa`),
  ADD KEY `curator` (`curator`);

--
-- Індекси таблиці `history`
--
ALTER TABLE `history`
  ADD PRIMARY KEY (`id`);

--
-- Індекси таблиці `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`),
  ADD KEY `avtor` (`avtor`);

--
-- Індекси таблиці `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id_students`),
  ADD KEY `grupa` (`grupa`);

--
-- Індекси таблиці `teachers`
--
ALTER TABLE `teachers`
  ADD PRIMARY KEY (`id_teacher`);

--
-- Індекси таблиці `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `documents`
--
ALTER TABLE `documents`
  MODIFY `id_documents` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблиці `educational`
--
ALTER TABLE `educational`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблиці `galery`
--
ALTER TABLE `galery`
  MODIFY `id_galery` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблиці `grupa`
--
ALTER TABLE `grupa`
  MODIFY `id_grupa` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблиці `history`
--
ALTER TABLE `history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблиці `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблиці `students`
--
ALTER TABLE `students`
  MODIFY `id_students` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблиці `teachers`
--
ALTER TABLE `teachers`
  MODIFY `id_teacher` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT для таблиці `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Обмеження зовнішнього ключа збережених таблиць
--

--
-- Обмеження зовнішнього ключа таблиці `documents`
--
ALTER TABLE `documents`
  ADD CONSTRAINT `documents_ibfk_1` FOREIGN KEY (`avtor`) REFERENCES `teachers` (`id_teacher`);

--
-- Обмеження зовнішнього ключа таблиці `grupa`
--
ALTER TABLE `grupa`
  ADD CONSTRAINT `grupa_ibfk_1` FOREIGN KEY (`curator`) REFERENCES `teachers` (`id_teacher`);

--
-- Обмеження зовнішнього ключа таблиці `news`
--
ALTER TABLE `news`
  ADD CONSTRAINT `news_ibfk_1` FOREIGN KEY (`avtor`) REFERENCES `teachers` (`id_teacher`);

--
-- Обмеження зовнішнього ключа таблиці `students`
--
ALTER TABLE `students`
  ADD CONSTRAINT `students_ibfk_1` FOREIGN KEY (`grupa`) REFERENCES `grupa` (`id_grupa`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
